modm-ext/archive-stmicro-svd/rm_rm0468_stm32h723veh6.svd
      <register>
        <name>S7CR</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PFCTRL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIR</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CIRC</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PINC</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MINC</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PSIZE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MSIZE</name>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PINCOS</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DBM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CT</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRBUFF</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PBURST</name>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MBURST</name>
            <bitOffset>23</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>25</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S7NDTR</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>NDT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S7PAR</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S7M0AR</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>M0A</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S7M1AR</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>M1A</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S7FCR</name>
        <addressOffset>0xcc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FTH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DMDIS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>FEIE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>DMAMUX1</name>
      <baseAddress>0x40020800</baseAddress>
      <register>
        <name>C0CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C1CR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C2CR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C3CR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C4CR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C5CR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C6CR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C7CR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C8CR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C9CR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C10CR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C11CR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C12CR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>C13CR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAREQ_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>SOIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EGE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBREQ</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SYNC_ID</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
