modm-ext/archive-stmicro-svd/rm_rm0468_stm32h723veh6.svd
      <register>
        <name>CSR13</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR14</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR15</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR16</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR17</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR18</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR19</name>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR20</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR21</name>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR22</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR23</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR24</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR25</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR26</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR27</name>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR28</name>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR29</name>
        <addressOffset>0x16c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR30</name>
        <addressOffset>0x170</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR31</name>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR32</name>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR33</name>
        <addressOffset>0x17c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR34</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR35</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR36</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR37</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR38</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR39</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR40</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR41</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR42</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR43</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR44</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR45</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR46</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR47</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR48</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR49</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR50</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR51</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR52</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR53</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CSx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR0</name>
        <addressOffset>0x310</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR1</name>
        <addressOffset>0x314</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR2</name>
        <addressOffset>0x318</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR3</name>
        <addressOffset>0x31c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR4</name>
        <addressOffset>0x320</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR5</name>
        <addressOffset>0x324</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H5</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR6</name>
        <addressOffset>0x328</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H6</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HR7</name>
        <addressOffset>0x32c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>H7</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <baseAddress>0x48021800</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
          </field>
          <field>
            <name>RNGEN</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CED</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RNG_CONFIG3</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>NISTC</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RNG_CONFIG2</name>
            <bitOffset>13</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CLKDIV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>RNG_CONFIG1</name>
            <bitOffset>20</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>CONDRST</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CONFIGLOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DRDY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CECS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SECS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>3</bitOffset>
            <bitWidth>29</bitWidth>
          </field>
          <field>
            <name>CEIS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SEIS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RNDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HTCR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HTCFG</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>SDMMC2</name>
      <baseAddress>0x48022400</baseAddress>
      <register>
        <name>POWER</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PWRCTRL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>VSWITCH</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VSWITCHEN</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIRPOL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLKCR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CLKDIV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>10</bitOffset>
            <bitWidth>22</bitWidth>
          </field>
          <field>
            <name>PWRSAV</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WIDBUS</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NEGEDGE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HWFC_EN</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DDR</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSSPEED</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SELCLKRX</name>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ARGR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CMDARG</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CMDINDEX</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>CMDTRANS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDSTOP</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITRESP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>WAITINT</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITPEND</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CPSMEN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTHOLD</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOOTMODE</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOOTEN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDSUSPEND</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>17</bitOffset>
            <bitWidth>15</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RESPCMDR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RESPCMD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>6</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RESP1R</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CARDSTATUS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
