modm-ext/archive-stmicro-svd/rm_rm0468_stm32h723veh6.svd
      <register>
        <name>SMPR1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SMP0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP1</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP2</name>
            <bitOffset>6</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP3</name>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP4</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP5</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP6</name>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP7</name>
            <bitOffset>21</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP8</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP9</name>
            <bitOffset>27</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMPR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SMP10</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP11</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP12</name>
            <bitOffset>6</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP13</name>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP14</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP16</name>
            <bitOffset>18</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP17</name>
            <bitOffset>21</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP18</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SMP19</name>
            <bitOffset>27</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PCSEL</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PCSEL0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL18</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCSEL19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LTR1</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LTR1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HTR1</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HTR1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SQR1</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>L</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>28</bitWidth>
          </field>
          <field>
            <name>SQ1</name>
            <bitOffset>6</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ2</name>
            <bitOffset>12</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ3</name>
            <bitOffset>18</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ4</name>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SQR2</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SQ5</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
          <field>
            <name>SQ6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ7</name>
            <bitOffset>12</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ8</name>
            <bitOffset>18</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ9</name>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SQR3</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SQ10</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
          <field>
            <name>SQ11</name>
            <bitOffset>6</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ13</name>
            <bitOffset>18</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SQ14</name>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SQR4</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SQ15</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
          <field>
            <name>SQ16</name>
            <bitOffset>6</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JSQR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>JEXTSEL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>JEXTEN</name>
            <bitOffset>7</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>JSQ1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>JSQ2</name>
            <bitOffset>15</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>JSQ3</name>
            <bitOffset>21</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>JSQ4</name>
            <bitOffset>27</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OFR1</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OFFSET1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>OFFSET1_CH</name>
            <bitOffset>26</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SSATE</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OFR2</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OFFSET2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>OFFSET2_CH</name>
            <bitOffset>26</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SSATE</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OFR3</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OFFSET3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>OFFSET3_CH</name>
            <bitOffset>26</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SSATE</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OFR4</name>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OFFSET4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>OFFSET4_CH</name>
            <bitOffset>26</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>SSATE</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR1</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR2</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR3</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR4</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AWD2CR</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AWD2CH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AWD3CR</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AWD3CH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LTR2</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LTR2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HTR2</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HTR2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LTR3</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LTR3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HTR3</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HTR3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>26</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIFSEL</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DIFSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CALFACT</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CALFACT_S</name>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>11</bitOffset>
            <bitWidth>21</bitWidth>
          </field>
          <field>
            <name>CALFACT_D</name>
            <bitOffset>16</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CALFACT2</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LINCALFACT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>HSEM</name>
      <baseAddress>0x58026400</baseAddress>
      <register>
        <name>R0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>MASTERID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>MASTERID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R31</name>
        <addressOffset>0x7c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>MASTERID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RLR0</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>MASTERID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
